#### Import Libraries

In [14]:
import pandas as pd
from sqlalchemy import create_engine
import os
import numpy as np

#### Connect to Postgress SQL DB

In [15]:
pg_user = 'postgres'
pg_password = 'mobo0056'
db_name = 'Enterprises'

connection_string = f"{pg_user}:{pg_password}@localhost:5432/{db_name}"
engine = create_engine(f'postgresql://{connection_string}')

#### Get table Names

In [16]:
engine.table_names()

['NAICS', 'BUSINESSES']

#### Create dataframe from SQL Query

In [18]:
bus_df = pd.read_sql_query('select * from "BUSINESSES"', con=engine)

#### Refine Dataframe to only include relevant columns

In [ ]:
business_df = bus_df[[ 'STATE DESCRIPTION', 'NAICS CODE', 'ENTERPRISE EMPLOYMENT SIZE 2', 'NUMBER OF FIRMS', 'NUMBER OF ESTABLISHMENTS', 'EMPLOYMENT', 'ANNUAL PAYROLL ($1,000)', 'YEAR']].copy()
business_df = business_df.rename(columns = {'ENTERPRISE EMPLOYMENT SIZE 2': 'ENTERPRISE EMPLOYMENT SIZE' })
business_df.head()

#### Convert Payroll column to real value from rounded value

In [ ]:
business_df['ANNUAL PAYROLL'] = business_df['ANNUAL PAYROLL ($1,000)'] * 1000

#### Delete Original Payroll Column

In [21]:
del business_df['ANNUAL PAYROLL ($1,000)']

#### Define Primary Dataframe

In [27]:
business_df1 = business_df
business_df1.head()

,STATE DESCRIPTION,NAICS CODE,ENTERPRISE EMPLOYMENT SIZE,NUMBER OF FIRMS,NUMBER OF ESTABLISHMENTS,EMPLOYMENT,YEAR,ANNUAL PAYROLL
0,Alabama,11,Total,870,890,6428,2008,208455000
1,Alabama,11,0-4,433,433,867,2008,25451000
2,Alabama,11,5-9,259,259,1708,2008,48440000
3,Alabama,11,10-19,112,112,1468,2008,47620000
4,Alabama,11,<20,804,804,4043,2008,121511000